<a href="https://colab.research.google.com/github/Kevoen/Google_Colab_Rep/blob/master/%E7%AC%AC%E4%B8%80%E7%AB%A0%EF%BC%9A%E7%AC%AC%E4%BA%8C%E8%8A%82pandas%E5%9F%BA%E7%A1%80_%E8%AF%BE%E7%A8%8B.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 0. 链接与挂载Google Drive

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [2]:
!ln -s /content/drive/My\ Drive/ /mydrive
!ls /mydrive

ls: cannot access 'mydrive': No such file or directory

In [3]:
%cd /mydrive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/第一单元项目集合

/content/drive/My Drive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/第一单元项目集合

**复习：**数据分析的第一步，加载数据我们已经学习完毕了。当数据展现在我们面前的时候，我们所要做的第一步就是认识他，今天我们要学习的就是**了解字段含义以及初步观察数据**。

## 1 第一章：数据载入及初步观察

### 1.4 知道你的数据叫什么
我们学习pandas的基础操作，那么上一节通过pandas加载之后的数据，其数据类型是什么呢？

**开始前导入numpy和pandas**

In [5]:
import numpy as np
import pandas as pd

#### 1.4.1 任务一：pandas中有两个数据类型DateFrame和Series，通过查找简单了解他们。然后自己写一个关于这两个数据类型的小例子🌰[开放题]

- Series 是带标签的一维数组，可存储整数、浮点数、字符串、Python 对象等类型的数据。轴标签统称为索引。

In [7]:
#写入代码
s = pd.Series(np.random.randn(4),index=['a','b','c','d'])
s

0   -0.925946
1   -0.377677
2    1.079876
3   -0.771658
dtype: float64

In [8]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
pd.Series(np.random.randn(4))

0   -0.191280
1   -1.958319
2    0.223907
3   -0.341268
dtype: float64

In [10]:
d = {'b': 1, 'a': 0, 'c': 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

- DataFrame 是由多种类型的列构成的二维标签数据结构

In [11]:
d = {'one': [1., 2., 3., 4.],'two': [4., 3., 2., 1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [12]:
 d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
 pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

#### 1.4.2 任务二：根据上节课的方法载入"train.csv"文件

In [14]:
#写入代码
df = pd.read_csv('train.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

也可以加载上一节课保存的"train_chinese.csv"文件。通过翻译版train_chinese.csv熟悉了这个数据集，然后我们对trian.csv来进行操作
#### 1.4.3 任务三：查看DataFrame数据的每列的项

In [15]:
#写入代码
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.4任务四：查看"cabin"这列的所有项 [有多种方法]

In [21]:
#写入代码
df['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [22]:
#写入代码
df.Cabin.head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

#### 1.4.5 任务五：加载文件"test_1.csv"，然后对比"train.csv"，看看有哪些多出的列，然后将多出的列删除
经过我们的观察发现一个测试集test_1.csv有一列是多余的，我们需要将这个多余的列删去

In [24]:
#写入代码
test_1 = pd.read_csv('test_1.csv')
test_1.head()

   Unnamed: 0  PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked    a
0           0            1         0       3  ...   7.2500   NaN         S  100
1           1            2         1       1  ...  71.2833   C85         C  100
2           2            3         1       3  ...   7.9250   NaN         S  100
3           3            4         1       1  ...  53.1000  C123         S  100
4           4            5         0       3  ...   8.0500   NaN         S  100

[5 rows x 14 columns]

In [25]:
#写入代码
del test_1['a']
test_1.head()

   Unnamed: 0  PassengerId  Survived  ...     Fare Cabin Embarked
0           0            1         0  ...   7.2500   NaN        S
1           1            2         1  ...  71.2833   C85        C
2           2            3         1  ...   7.9250   NaN        S
3           3            4         1  ...  53.1000  C123        S
4           4            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

【思考】还有其他的删除多余的列的方式吗？

In [35]:
# 思考回答
test_1 = pd.read_csv('test_1.csv')

test_1.pop('a')
test_1.head()

   Unnamed: 0  PassengerId  Survived  ...     Fare Cabin Embarked
0           0            1         0  ...   7.2500   NaN        S
1           1            2         1  ...  71.2833   C85        C
2           2            3         1  ...   7.9250   NaN        S
3           3            4         1  ...  53.1000  C123        S
4           4            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [37]:
test_1 = pd.read_csv('test_1.csv')
test_1.drop(['a'],axis=1,inplace=True)
test_1.head()

   Unnamed: 0  PassengerId  Survived  ...     Fare Cabin Embarked
0           0            1         0  ...   7.2500   NaN        S
1           1            2         1  ...  71.2833   C85        C
2           2            3         1  ...   7.9250   NaN        S
3           3            4         1  ...  53.1000  C123        S
4           4            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [34]:
# 自动删除
test_1 = pd.read_csv('test_1.csv')
df = pd.read_csv('train.csv')
df_col = df.columns
test_col = test_1.columns
for __,index in enumerate(test_col):
  flag = False
  for df_ind in df_col:
    if df_ind == index:
      flag = True
  if flag == False:
    del test_1[index]
    print("delete",index)

test_1.head()

delete Unnamed: 0
delete a

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

#### 1.4.6 任务六： 将['PassengerId','Name','Age','Ticket']这几个列元素隐藏，只观察其他几个列元素

In [39]:
#写入代码

df.drop(['PassengerId','Name','Age','Ticket'],axis=1).head(3)

   Survived  Pclass     Sex  SibSp  Parch     Fare Cabin Embarked
0         0       3    male      1      0   7.2500   NaN        S
1         1       1  female      1      0  71.2833   C85        C
2         1       3  female      0      0   7.9250   NaN        S

【思考】对比任务五和任务六，是不是使用了不一样的方法(函数)，如果使用一样的函数如何完成上面的不同的要求呢？

【思考回答】

如果想要完全的删除你的数据结构，使用inplace=True，因为使用inplace就将原数据覆盖了，所以这里没有用

### 1.5 筛选的逻辑

表格数据中，最重要的一个功能就是要具有可筛选的能力，选出我所需要的信息，丢弃无用的信息。

下面我们还是用实战来学习pandas这个功能。

#### 1.5.1 任务一： 我们以"Age"为筛选条件，显示年龄在10岁以下的乘客信息。

In [41]:
#写入代码
df[df.Age<10].head(3)

    PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
7             8         0       3  ...  21.075   NaN         S
10           11         1       3  ...  16.700    G6         S
16           17         0       3  ...  29.125   NaN         Q

[3 rows x 12 columns]

#### 1.5.2 任务二： 以"Age"为条件，将年龄在10岁以上和50岁以下的乘客信息显示出来，并将这个数据命名为midage

In [42]:
#写入代码
df[(df.Age>10)&(df.Age<50)].head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

【提示】了解pandas的条件筛选方式以及如何使用交集和并集操作

#### 1.5.3 任务三：将midage的数据中第100行的"Pclass"和"Sex"的数据显示出来

In [44]:
#写入代码
# midage = df.reset_index(drop=True)
df.loc[[100],['Pclass','Sex']]

     Pclass     Sex
100       3  female

【思考】这个reset_index()函数的作用是什么？如果不用这个函数，下面的任务会出现什么情况？

#### 1.5.4 任务四：将midage的数据中第100，105，108行的"Pclass"，"Name"和"Sex"的数据显示出来

In [47]:
#写入代码
df.loc[[100,105,108],['Pclass','Name','Sex']]

     Pclass                     Name     Sex
100       3  Petranec, Miss. Matilda  female
105       3    Mionoff, Mr. Stoytcho    male
108       3          Rekic, Mr. Tido    male

【提示】使用pandas提出的简单方式，你可以看看loc方法

对比整体的数据位置，你有发现什么问题吗？那么如何解决？

#### 1.5.5 任务五：使用iloc方法将midage的数据中第100，105，108行的"Pclass"，"Name"和"Sex"的数据显示出来

In [49]:
#写入代码
df.iloc[[100,105,108],[2,3,4]]

     Pclass                     Name     Sex
100       3  Petranec, Miss. Matilda  female
105       3    Mionoff, Mr. Stoytcho    male
108       3          Rekic, Mr. Tido    male